axis2/java/rampart/samples/msgs/req05.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1"><wsu:Timestamp wsu:Id="TS-e15efc97-d20b-4d14-985f-ad2a63f4e3d3"><wsu:Created>2024-10-30T20:19:20.786Z</wsu:Created><wsu:Expires>2024-10-30T20:24:20.786Z</wsu:Expires></wsu:Timestamp><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-94502b49-1d3f-4340-8236-c8d589dfa1ce"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">aqePjuZzE1lzwMMtquksvNJsbmI=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>D3kOoJiZBaq6CG+Q0arNG+MAXZmPNusXAWn6LhIFgutDzxwYp1vApxYsQoJTVpF/ingJPL/LeWn6/qrqh/Gcah1YbEP0jFhS/7nx7nRXTPToU/KzL2hfGD9f1ASmIRHnGh6jwMKPW3YI00g88/6W1raQ6lgSvbOY77OHTm0ZfFk=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey><saml1:Assertion xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" AssertionID="55763a2c96ebccb95943ad00554ae7fb087af7a019ca2fc9" Issuer="SAMPLE_STS" IssueInstant="2024-10-30T20:19:20.623Z" MajorVersion="1" MinorVersion="1"><saml1:Conditions NotBefore="2024-10-30T20:19:20.579Z" NotOnOrAfter="2024-10-30T20:24:20.579Z"/><saml1:AttributeStatement><saml1:Subject><saml1:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">CN=Sample Client, OU=Rampart, O=Apache, L=Colombo, ST=Western, C=LK</saml1:NameIdentifier><saml1:SubjectConfirmation><saml1:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</saml1:ConfirmationMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-a78a9630-09e9-445e-9397-f94f46bb2e6c"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo><wsse:SecurityTokenReference><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">aqePjuZzE1lzwMMtquksvNJsbmI=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>S2FSb2JXdU8vMmZ4UmJXUmpHaXdHZEpzRitBPQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo></saml1:SubjectConfirmation></saml1:Subject><saml1:Attribute AttributeName="Name" AttributeNamespace="https://rahas.apache.org/saml/attrns"><saml1:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Colombo/Rahas</saml1:AttributeValue></saml1:Attribute></saml1:AttributeStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#55763a2c96ebccb95943ad00554ae7fb087af7a019ca2fc9">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd"/></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
<ds:DigestValue>zDRlaomxEIP/yt+y4HYVVjaJDYxOkLu10oNQD3Ppxq0=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
hDy5fx+KI8Mp+iZzUJjTl15O1jekERBWvWyLUT4922EBbj8Jrn0lkF/klkIwR8VT51mbz5w+Vbk1&#13;
IudG/+2jIN+uHmzOCi6b+JagZIT9PJmqS1jWaIw3NCqGQGpkqIvERsF2lCJB/R503t0o2cWK1Ye2&#13;
j/vl2skHg0/llfxamcA=
</ds:SignatureValue>
<ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIICUTCCAbqgAwIBAgIESy9OZzANBgkqhkiG9w0BAQUFADBtMQswCQYDVQQGEwJMSzEQMA4GA1UECBMHV2VzdGVybjEQMA4GA1UEBxMHQ29sb21ibzEPMA0GA1UEChMGQXBhY2hlMRAwDgYDVQQLEwdSYW1wYXJ0MRcwFQYDVQQDEw5TYW1wbGUgU2VydmljZTAeFw0wOTEyMjExMDMxMDNaFw0zNzA1MDcxMDMxMDNaMG0xCzAJBgNVBAYTAkxLMRAwDgYDVQQIEwdXZXN0ZXJuMRAwDgYDVQQHEwdDb2xvbWJvMQ8wDQYDVQQKEwZBcGFjaGUxEDAOBgNVBAsTB1JhbXBhcnQxFzAVBgNVBAMTDlNhbXBsZSBTZXJ2aWNlMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCJlCGEscCBZF0iS87nQIae6/dl4GiKuP/KVpWF15dtlX3MlYPciUtE64khoj8D/xlZFpDQ1V6B4gMVgdNtCzWRyd/dQ+YofjLEzCmgmQ7Ze32Y+QCnagYoTyLnXWXbAKHLrnFNu0BUdKm5IpKF8ZayhOn4tTqnMKPBHaN28m1BNQIDAQABMA0GCSqGSIb3DQEBBQUAA4GBABJZprOOBsOStSYd1AeKS4Nslo6JX3Xsz7dKxl2OSekzWQhMIeKxbdvHqCf2rGzinMomGLBie1lndhzmd7qxpCeQGLJHdttCTNKleOjt+s+U7vHzLKi0wOcmdTc3xWBgXOcfgyw3HDXVrXUlnnrAWNeU4tnm+Obu9LkmRcDF7Op0</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></saml1:Assertion><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-7c8b1190-df25-498d-8b99-9eae6497162d"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsa soapenv"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><ds:Reference URI="#Id-525041703"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>uJnDx44AgUY4RU8MYfpzhwTI2Yk=</ds:DigestValue></ds:Reference><ds:Reference URI="#id-337a0396-f81d-46bc-a086-89c9f3dbdc34"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soapenv"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>q/bN68PiFv8k6XnYqrByBEL0Z/4=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS-e15efc97-d20b-4d14-985f-ad2a63f4e3d3"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse wsa soapenv"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>wWVtWxipZCBFnQOXwp+GrWM/TMI=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>9FRpRZu67xM2fusn9NP7rPw/yNQ=</ds:SignatureValue><ds:KeyInfo Id="KI-24ba10ca-1edd-424f-aac5-a0064104cb35"><wsse:SecurityTokenReference xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsu:Id="STR-e923a847-0ee6-482c-815b-f05075a83150" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" URI="#EK-94502b49-1d3f-4340-8236-c8d589dfa1ce"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security><wsa:To xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-337a0396-f81d-46bc-a086-89c9f3dbdc34">http://localhost:37647/axis2/services/sample05</wsa:To><wsa:MessageID>urn:uuid:74153149-02f9-452c-ac2d-56dcaa77e43b</wsa:MessageID><wsa:Action>urn:echo</wsa:Action></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Id-525041703"><ns1:echo xmlns:ns1="http://sample05.policy.samples.rampart.apache.org"><param0>Hello world1</param0></ns1:echo></soapenv:Body></soapenv:Envelope>
